# Brewfile
# List of all packages installed by Homebrew

# Libraries

brew 'libxml2'
brew 'libyaml'
brew 'libxslt'

# Ruby Environment

brew 'rbenv'
brew 'ruby-build'    # rbenv plugin that provides an rbenv install command for compiling different versions of Ruby

# Development

brew 'cloc'          # tool for counting lines of code
brew 'class-dump'    # command-line utility for examining the Objective-C runtime information
brew 'appledoc'
brew 'mogenerator'   # Core Data code generator
brew 'tidy'          # HTML Tidy
brew 'highlight'     # tool for converting source code to various formats by adding syntax highlighting

# Git

brew 'git'
brew 'git-flow'
brew 'tig'           # command-line text-mode interface for Git
brew 'gource'        # software version control visualization tool
brew 'bfg'           # removes large or troublesome blobs like git-filter-branch does, but faster

# Compilers

brew 'gcc'
brew 'apple-gcc42'
brew 'ghc'

# Networking

brew 'wget'          # command-line tool for retrieving files using HTTP, HTTPS and FTP
brew 'httpie'        # command-line HTTP client and a user-friendly cURL replacement
brew 'nmap'          # security scanner for network exploration

# Media

brew 'ffmpeg'
brew 'graphviz'
brew 'ghostscript'   # interpreter for the PostScript language and for PDF

# Utilities

brew 'tree'          # recursive directory listing command
brew 'trash'         # small command-line program for OS X that moves files or folders to the trash
brew 'dos2unix'      # DOS to Unix text file format converter
brew 'peco'          # simplistic interactive filtering tool
brew 'youtube-dl'    # small command-line program to download videos from YouTube.com
brew 's3cmd'         # Amazon S3 command-line client
brew 'gnupg'         # GPG

# Fun Stuff

brew 'cmatrix'       # little command line program which shows the scrolling lines from 'The Matrix'
