# Taps
tap "caskroom/cask"
tap "tldr-pages/tldr"

# Homebrew Cask
brew "brew-cask"

# Core Libraries
brew "libxml2"
brew "libyaml"
brew "libxslt"

# Compilers
brew "gcc"
brew "ghc"
brew "cmake"

# Ruby Environment
brew "rbenv"
brew "ruby-build"             # rbenv plugin that provides an rbenv install command for compiling different versions of Ruby

# Development
brew "lcov"                   # tool for counting lines of code
brew "cloc"                   # tool for counting lines of code
brew "class-dump"             # command line utility for examining the Objective-C runtime information
brew "highlight"              # tool for converting source code to various formats by adding syntax highlighting

# Xcode & Swift
brew "carthage"
brew "xcproj"
brew "swiftgen"
brew "swiftlint"
brew "sourcekitten"

# Git
brew "git"
brew "git-flow"
brew "hub"
brew "icdiff"               	# diff tool
brew "tig"                  	# command line text-mode interface for Git
brew "gource"               	# software version control visualization tool

# Security
brew "keybase"                # keybase.io tool
brew "gnupg"                	# GPG

# Networking
brew "wget"                 	# command line tool for retrieving files using HTTP, HTTPS and FTP
brew "httpie"               	# command line HTTP client and a user-friendly cURL replacement
brew "nmap"                 	# security scanner for network exploration

# Media
brew "ffmpeg"
brew "graphviz"
brew "ghostscript"            # interpreter for the PostScript and PDF
cask "wkhtmltopdf"

# Utilities
brew "tree"                   # recursive directory listing command
brew "trash"                  # small command line program for OS X that moves files or folders to the trash
brew "dos2unix"               # DOS to Unix text file format converter
brew "peco"                   # simplistic interactive filtering tool
brew "youtube-dl"             # small command line program to download videos from YouTube.com
brew "s3cmd"                  # Amazon S3 command line client
brew "thefuck"                # command line utility for correcting mistyped commands
brew "tldr"

# QuickLook Plugins
cask "provisionql"
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "qlimagesize"
cask "suspicious-package"

# Color Pickers
cask "colorpicker-developer"
cask "colorpicker-hex"

# OS X
brew "mas"

# Fun Stuff
brew "cmatrix"                # little command line program which shows the scrolling lines from 'The Matrix'
brew "cowsay"
